In [62]:
import pandas as pd
import kagglehub

In [63]:
path = kagglehub.dataset_download("sudalairajkumar/indian-startup-funding")
csv_path = f"{path}/startup_funding.csv"

In [64]:
df = pd.read_csv(csv_path)
# df.head()
# df.shape
# df.info()

In [65]:
# Data Cleaning

# df.isnull().sum()

In [66]:
# 1. Clean City Names

df[df['City  Location'].isnull()]

df['City  Location'] = df['City  Location'].str.strip().str.title()

df["City  Location"] = df["City  Location"].replace({
    'Delhi': 'New Delhi',
    'Bangalore': 'Bengaluru'
})

In [67]:
df["Amount in USD"].unique()[:20]

def clean_funding(x):
    if pd.isnull(x):
        return 0
    if isinstance(x, str):
        x = x.replace(',', '')
        if x.strip().lower() == 'undisclosed':
            return 0
        
    try:
        return float(x)
    except:
        return 0
    
df["Amount in USD"] = df["Amount in USD"].apply(clean_funding)

In [74]:
df["Date dd/mm/yyyy"] = pd.to_datetime(df["Date dd/mm/yyyy"], errors='coerce')
df['Year'] = df['Date dd/mm/yyyy'].dt.year
df['Month'] = df['Date dd/mm/yyyy'].dt.month

In [75]:
# df.head(10)
df[['Startup Name', 'City  Location', 'Amount in USD', 'Year']].sample(5)

      Startup Name City  Location  Amount in USD    Year
168      My OmNamo         Mumbai      1000000.0  2018.0
2491  Wetravelsolo      New Delhi            0.0  2015.0
570       Ola Cabs      Bengaluru      7700000.0     NaN
2166       STAGE 3      New Delhi            0.0     NaN
240       HomeLane      Bengaluru      3450000.0     NaN